myconfig.org
#+AUTHOR: Egor Tolbaev
#+TITLE: GNU Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table of Contents                                                   :TOC_3:
- [[#about][About]]
- [[#startup-performance][Startup Performance]]
- [[#переменные-ос][Переменные ОС]]
- [[#package-system-setup][Package System Setup]]
- [[#keep-emacsd-clean][Keep .emacs.d Clean]]
- [[#general-settings][General settings]]
  - [[#defaults][Defaults]]
  - [[#fonts][Fonts]]
  - [[#кодировка][Кодировка]]
  - [[#парные-элементы][Парные элементы]]
  - [[#перенос-по-словам][Перенос по словам]]
  - [[#чистим-пробелы][Чистим пробелы]]
  - [[#отключить-сохранений][Отключить сохранений]]
  - [[#auto-mode-alist][Auto mode alist]]
  - [[#edit-this-configuration-file-shortcut][Edit This Configuration File Shortcut]]
- [[#ui][UI]]
  - [[#theme][Theme]]
  - [[#переключение-темы][Переключение темы]]
    - [[#светлая-тема][Светлая тема]]
    - [[#темная-тема][Темная тема]]
  - [[#modeline][Modeline]]
  - [[#icons][Icons]]
  - [[#отображение-времени][Отображение времени]]
  - [[#настройка-фрейма][Настройка фрейма]]
  - [[#golden-ratio][Golden ratio]]
  - [[#highlight-indent-guides][Highlight indent guides]]
    - [[#commands][Commands]]
    - [[#settings][Settings]]
- [[#office][Office]]
  - [[#org-mode][Org mode]]
    - [[#commands-1][Commands]]
    - [[#описание-рабочего-процесса][Описание рабочего процесса]]
    - [[#basic-config][Basic Config]]
    - [[#настройка-org-protocol][Настройка org-protocol]]
    - [[#capture][Capture]]
    - [[#org-roam][Org-roam]]
    - [[#org-roam-ui][Org-roam-ui]]
    - [[#org-bullets][Org bullets]]
    - [[#center-org-buffers][Center Org Buffers]]
    - [[#toc-org][Toc org]]
    - [[#block-templates][Block Templates]]
    - [[#quick-file-access][Quick file access]]
    - [[#auto-tangle-configuration-files][Auto-tangle Configuration Files]]
  - [[#markdown][Markdown]]
- [[#file-management][File Management]]
  - [[#dired][Dired]]
    - [[#commands-2][Commands]]
    - [[#settings-1][Settings]]
  - [[#deft][Deft]]
    - [[#commands-3][Commands]]
    - [[#settings-2][Settings]]
- [[#modes][Modes]]
  - [[#ivy][IVY]]
    - [[#commands-4][Commands]]
    - [[#settings-3][Settings]]
  - [[#ivy-rich][IVY-RICH]]
  - [[#counsel][COUNSEL]]
  - [[#helpful][Helpful]]
  - [[#which-key][Which Key]]
- [[#general-packages][General packages]]
  - [[#bs][BS]]
  - [[#dashboard][Dashboard]]
  - [[#reverse-im][Reverse-im]]
  - [[#browser][Browser]]
    - [[#engine-mode][Engine-mode]]
  - [[#hydra][Hydra]]
    - [[#commands-5][Commands]]
    - [[#settings-hydra][Settings Hydra]]
    - [[#hydra--browser][Hydra / Browser]]
    - [[#hydra--treemacs][Hydra / Treemacs]]
    - [[#hydra--theme][Hydra / Theme]]
    - [[#hydra--org][Hydra / Org]]
    - [[#hydra--windows][Hydra / Windows]]
    - [[#hydra--text][Hydra / Text]]
    - [[#hydra--file-gtd][Hydra / File GTD]]
- [[#development][Development]]
  - [[#languages][Languages]]
    - [[#ide-features-with-lsp-mode][IDE Features with lsp-mode]]
    - [[#debugging-with-dap-mode][Debugging with dap-mode]]
    - [[#typescript-and-javascript][TypeScript and JavaScript]]
    - [[#python][Python]]
    - [[#csharp][CSharp]]
    - [[#company-mode][Company Mode]]
    - [[#web-mode][Web mode]]
    - [[#json][JSON]]
    - [[#yaml][YAML]]
    - [[#makefile][Makefile]]
  - [[#buildsystem][Buildsystem]]
    - [[#docker][Docker]]
  - [[#projectile][Projectile]]
    - [[#commands-6][Commands]]
    - [[#settings-4][Settings]]
  - [[#magit][Magit]]
    - [[#commands-7][Commands]]
    - [[#settings-5][Settings]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
- [[#terminals][Terminals]]
  - [[#eshell][Eshell]]

* About

#+begin_src emacs-lisp

  ;;; init.el --- Initialisation file for GNU Emacs

  ;; Copyright © 2020-2022 Egor Tolbaev <egor05.09.97@gmail.com>

  ;; Author: Egor Tolbaev <egor05.09.97@gmail.com>
  ;; URL: https://github.com/EgorTolbaev/.emacs.d
  ;; Keywords: emacs, init, init.el, dotfiles

  ;; This file is NOT part of GNU Emacs.

  ;;; Commentary:
  ;;
  ;; I decided to create my own GNU Emacs configuration
  ;; to simplify my daily life by adding scripts and useful features.
  ;; This configuration does not claim to be ideal and is in constant development, but it is fully operational.
  ;; This file is generated based on myconfig.org

  ;;; Code:

#+end_src

Я решил создать свою собственную конфигурацию GNU Emacs, что бы упростить мою повседневную жизнь, добавив сценарии и полезные функции.

Для управления конфигурациями пакетов я использую пакет use-package от John Wiegley.

Этот файл генерирует [[https://github.com/EgorTolbaev/.emacs.d/blob/master/init.el][init.el]] который будет загружен GNU Emacs при запуске.

* Startup Performance

Ускорьте запуск, уменьшив частоту сборки мусора.

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000))

#+end_src

* Переменные ОС

Некоторые части конфигурации отличаются в зависимости от системы, поэтому я определил функции для дальнейшего использовани.

#+begin_src emacs-lisp

  (defun system-is-linux()
    (string-equal system-type "gnu/linux"))
  (defun system-is-windows()
    (string-equal system-type "windows-nt"))

#+end_src

* Package System Setup

[[https://github.com/jwiegley/use-package][use-package]] - упрощает установку пакетов.

#+begin_src emacs-lisp

  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
      (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* Keep .emacs.d Clean

Переносим переменные, созданные Custom в отдельный файл.

#+begin_src emacs-lisp

  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))

#+end_src

* General settings

** Defaults

Для лучшего взаимодействия с GNU Emacs я использую следующие значения по умолчанию.

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  ;; (setq ring-bell-function 'ignore)              ; Отключить звуковой сигнал
  (blink-cursor-mode -1)                            ; Курсор не мигает
  (fset 'yes-or-no-p 'y-or-n-p)                     ; Замена yes-or-on на y-or-n

  (menu-bar-mode -1)    ; Не показывать меню
  (scroll-bar-mode -1)  ; Не показывать полосу прокрутки
  (tool-bar-mode -1)    ; Не показывать панель инструментов

  (setq visible-bell t) ; Установите видимый звонок

  (setq user-full-name "Egor Tolbaev")              ; Имя пользователя
  (setq user-mail-address "egor05.09.97@gmail.com") ; Email пользователя

  ;; Показ номера строки стандартными средствами
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Отключить номера строк где они не нужны
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  org-agenda-mode-hook
                  treemacs-mode-hook
                  eww-mode-hook
                  calendar-mode-hook
                  deft-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Fonts

Использую [[https://github.com/adobe-fonts/source-code-pro][Source Code Pro]] или Consolas еще не решил:)

#+begin_src emacs-lisp

  (defvar et/default-font-size 110)
  ;;(set-face-attribute 'default nil :font "Consolas")
  (set-face-attribute 'default nil :font "Source Code Pro Medium" :height et/default-font-size)
  ;(set-fontset-font t 'latin "Noto Sans")
  (set-fontset-font t 'latin "Cantarell")

#+end_src

** Кодировка

#+begin_src emacs-lisp

  (set-language-environment 'UTF-8)
  (setq default-buffer-file-coding-system 'utf-8)
  (setq-default coding-system-for-read    'utf-8)
  (setq file-name-coding-system           'utf-8)
  (set-keyboard-coding-system        'utf-8-unix)
  (set-terminal-coding-system             'utf-8)
  (prefer-coding-system                   'utf-8)

#+end_src

** Парные элементы

Теперь при вводе парного элемента типа "(" они автоматически закрываються

#+begin_src emacs-lisp

  (electric-pair-mode t)
  (show-paren-mode 1)

#+end_src

** Перенос по словам

Слова которые не помещаются по размеру фрейма переносится на другую сторку

#+begin_src emacs-lisp

  (setq word-wrap t)
  (global-visual-line-mode t)

#+end_src

** Чистим пробелы

При сохранение файла удаляются лишние пробелы в конце строки и файла.

#+begin_src emacs-lisp

  (add-hook 'before-save-hook '(lambda () (delete-trailing-whitespace)))

#+end_src

** Отключить сохранений

#+begin_src emacs-lisp

  (setq make-backup-files nil)        ; Не нужны файлы резервных копий
  (setq auto-save-list-file-name nil) ; Не нужны файлы .saves
  (setq auto-save-default nil)        ; Не хочу автосохранения

#+end_src

** Auto mode alist

#+begin_src emacs-lisp

    (setq auto-mode-alist
        (append
         '(("\\.el$"  . emacs-lisp-mode)
           ("\\.org$" . org-mode)
           ("\\.tex$" . latex-mode))))

#+end_src

** Edit This Configuration File Shortcut

#+begin_src emacs-lisp

  (defun edit-configs ()
    "Opens the README.org file."
    (interactive)
    (find-file "~/.emacs.d/myconfig.org"))

  (global-set-key (kbd "C-x e") #'edit-configs)

#+end_src

* UI

** Theme

Я использую темы [[https://github.com/hlissner/emacs-doom-themes][doom-themes]] в сочетании с [[https://github.com/EgorTolbaev/.emacs.d/blob/master/myconfig.org#modeline][doom-modeline]]. Для отображения значков в doom-modeline использую [[https://github.com/EgorTolbaev/.emacs.d/blob/master/myconfig.org#icons][all-the-icons]]

#+begin_src emacs-lisp

  (use-package doom-themes
    :config
      (load-theme 'doom-Iosvkem))

#+end_src

** Переключение темы

*** Светлая тема

#+begin_src emacs-lisp

  (defun set-light-theme()
    (interactive)
    (load-theme 'doom-opera-light))
    (global-set-key (kbd "<f8>") 'set-light-theme)

#+end_src

*** Темная тема

#+begin_src emacs-lisp

  (defun set-night-theme()
    (interactive)
    (load-theme 'doom-Iosvkem))
    (global-set-key (kbd "<f9>") 'set-night-theme)

#+end_src

** Modeline

GitHub: [[https://github.com/seagle0128/doom-modeline][doom-modeline]]

#+begin_src emacs-lisp

  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode))

#+end_src

** Icons

GitHub: [[https://github.com/domtronn/all-the-icons.el][all-the-icons]]

Для того, чтобы значки работали, очень важно, чтобы Вы установили шрифты ресурсов, включенные в этот пакет.

=M-x all-the-icons-install-fonts=

/Для Windows эта функция предложит указать каталог для загрузки/, /чтобы вы могли установить их вручную/.

#+begin_src emacs-lisp

  (use-package all-the-icons)

#+end_src

** Отображение времени

#+begin_src emacs-lisp

  (setq display-time-24hr-format t) ; 24-часовой временной формат в mode-line
  (display-time-mode t)             ; показывать часы в mode-line
  (size-indication-mode t)          ; размер файла в %-ах

#+end_src

