init.el
;;; init.el --- Initialisation file for Emacs

;; Copyright © 2020-2022 Egor Tolbaev <egor05.09.97@gmail.com>

;; Author: Egor Tolbaev <egor05.09.97@gmail.com>
;; URL: https://github.com/EgorTolbaev/.emacs.d
;; Keywords: emacs, init, init.el, dotfiles

;; This file is NOT part of GNU Emacs.

;;; Commentary:
;;
;; I decided to create my own GNU Emacs configuration
;; to simplify my daily life by adding scripts and useful features.
;; This configuration does not claim to be ideal and is in constant development, but it is fully operational.
;; This file is generated based on myconfig.org

;;; Code:

(setq gc-cons-threshold (* 50 1000 1000))

(defun system-is-linux()
  (string-equal system-type "gnu/linux"))
(defun system-is-windows()
  (string-equal system-type "windows-nt"))

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
    (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

(setq inhibit-startup-message t)

;; (setq ring-bell-function 'ignore)              ; Отключить звуковой сигнал
(blink-cursor-mode -1)                            ; Курсор не мигает
(fset 'yes-or-no-p 'y-or-n-p)                     ; Замена yes-or-on на y-or-n

(menu-bar-mode -1)    ; Не показывать меню
(scroll-bar-mode -1)  ; Не показывать полосу прокрутки
(tool-bar-mode -1)    ; Не показывать панель инструментов

(setq visible-bell t) ; Установите видимый звонок

(setq user-full-name "Egor Tolbaev")              ; Имя пользователя
(setq user-mail-address "egor05.09.97@gmail.com") ; Email пользователя

;; Показ номера строки стандартными средствами
(column-number-mode)
(global-display-line-numbers-mode t)

;; Отключить номера строк где они не нужны
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook
                org-agenda-mode-hook
                treemacs-mode-hook
                eww-mode-hook
                calendar-mode-hook
                deft-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

(defvar et/default-font-size 110)
;;(set-face-attribute 'default nil :font "Consolas")
(set-face-attribute 'default nil :font "Source Code Pro Medium" :height et/default-font-size)
;(set-fontset-font t 'latin "Noto Sans")
(set-fontset-font t 'latin "Cantarell")

(set-language-environment 'UTF-8)
(setq default-buffer-file-coding-system 'utf-8)
(setq-default coding-system-for-read    'utf-8)
(setq file-name-coding-system           'utf-8)
(set-keyboard-coding-system        'utf-8-unix)
(set-terminal-coding-system             'utf-8)
(prefer-coding-system                   'utf-8)

(electric-pair-mode t)
(show-paren-mode 1)

(setq word-wrap t)
(global-visual-line-mode t)

(add-hook 'before-save-hook '(lambda () (delete-trailing-whitespace)))

(setq make-backup-files nil)        ; Не нужны файлы резервных копий
(setq auto-save-list-file-name nil) ; Не нужны файлы .saves
(setq auto-save-default nil)        ; Не хочу автосохранения

(setq auto-mode-alist
    (append
     '(("\\.el$"  . emacs-lisp-mode)
       ("\\.org$" . org-mode)
       ("\\.tex$" . latex-mode))))

(defun edit-configs ()
  "Opens the README.org file."
  (interactive)
  (find-file "~/.emacs.d/myconfig.org"))

(global-set-key (kbd "C-x e") #'edit-configs)

(use-package doom-themes
  :config
    (load-theme 'doom-Iosvkem))

(defun set-light-theme()
  (interactive)
  (load-theme 'doom-opera-light))
  (global-set-key (kbd "<f8>") 'set-light-theme)

(defun set-night-theme()
  (interactive)
  (load-theme 'doom-Iosvkem))
  (global-set-key (kbd "<f9>") 'set-night-theme)

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode))

(use-package all-the-icons)

(setq display-time-24hr-format t) ; 24-часовой временной формат в mode-line
(display-time-mode t)             ; показывать часы в mode-line
(size-indication-mode t)          ; размер файла в %-ах
