myconfig.org
** Настройка фрейма

Устанавливаю прозрачность фрейма и разворачиваю окно по умолчанию.

/Что бы это было красиво следите за свои рабочим столом и окнами по зади фрейма GNU Emacs/

#+begin_src emacs-lisp

  (defun et/transparent-frame (bool)
    (if bool
        (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
      (set-frame-parameter (selected-frame) 'alpha '(100 . 100))))

  (et/transparent-frame t)

  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

** Golden ratio

GitHub: [[https://github.com/roman/golden-ratio.el][golden-ratio]]

Удобный способ работать с окнами, при перключении =golden-ratio= изменяет размер окна с которым работаете.

#+begin_src emacs-lisp

  (use-package golden-ratio
    :config
    (golden-ratio-mode 1))

#+end_src

** Highlight indent guides

GitHub: [[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides]]

=highlight-indent-guides= - пакет для выделения уровней отступов в коде. С этом режимом так же включаю [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Hideshow.html][hs-minor-mode]] что позволяет скрывать/показывать блок кода.

*** Commands

| command       | key / ex command | description                      |
|---------------+------------------+----------------------------------|
| hs-hide-block | =C-c @ C-d=      | скрыть текущий блок              |
| hs-show-block | =C-c @ C-s=      | показать текущий блок            |
| hs-hide-all   | =C-c @ C-t=      | скрыть все блоки верхнего уровня |
| hs-show-all   | =C-c @ C-a=      | показать все блоки в буфере      |
|---------------+------------------+----------------------------------|

*** Settings

#+begin_src emacs-lisp

  (use-package highlight-indent-guides
    :hook ((prog-mode . highlight-indent-guides-mode)
           (prog-mode . hs-minor-mode))
    :config
    (setq highlight-indent-guides-method 'character)
    (setq highlight-indent-guides-responsive 'top))

#+end_src

* Office

** Org mode

[[https://orgmode.org/][Org mode]] предназначен для ведения заметок, списков дел, планирования проектов и многого другого.

Описание: [[https://orgmode.org/manual/Handling-Links.html][org-store-link]], [[https://orgmode.org/manual/Capture.html][org-capture]], [[https://orgmode.org/manual/Agenda-Commands.html][org-agenda]]

*** Commands

| command                                 | key / ex command | description            |
|-----------------------------------------+------------------+------------------------|
| org-capture                             | =C-c c=          | создать заметку        |
| org-agenda                              | =C-c a=          | открыть agenda         |
| org-store-link                          | =C-c l=          | cоздать ссылку         |
| org-todo                                | =C-c C-t=        | изменить статус задачи |
| org-set-tags-command                    | =C-c C-q=        | поставить тег          |
| org-schedule                            | =C-c C-s=        | указать дату по плану  |
| org-deadline                            | =C-c C-d=        | указать дату дедлайна  |
| org-table-create-or-convert-from-region | =C-x pipe=       | создать таблицу        |
| calendar                                | -                | открыть календарь      |
|-----------------------------------------+------------------+------------------------|

*** Описание рабочего процесса
Вкратце опишу файлы и мой процесс работы с задачами.

*Важно*
Я не претендую на соблюдения всех принципов GTD, и не говорю что мой подход правильный, просто это работает для меня.

**** Файлы

У меня есть следующие файлы:

*inbox.org* - структуры у файла нет, это просто список все входящей информации, новые задачи, почта, статьи которые хочу прочитать и т.п;

*projects.org* - файл содержит задачи для выполнения которых требуеться больше чем одно действие. В нем есть два заголовка, "Дом" и "Работа";

*next_tasks.org* - так же как и projects.org содержит два заголовка, "Дом" и "Работа". По сути это просто список задач которые можно взять в работу;

*agenda.org* - у файла следующая структура:

+ Birthdays (Дни рождения)
+ Recurrent (Повторяющийся)
  + Scheduled (Запланированное)
  + Habits (Привычки)
+ Past (Прошли)
+ Future (Будущее)

Тут хронятся, дни рождения, привычки которые я хочу отслеживать, какие-то ежедневные задачи или рабочие встречи, а так же все что имеет конкретную запланированную дат;

*waiting.org* - хранит в себе список делегированных или чего то ожидающих задач;

*journal.org* - журнал дня, в нем я отслеживаю задачи которыми занимался в конкретный день, затраченное время на задачу, а также могу сделать заметку на этот день.

Структра:

+ Год
  + Месяц
    + День
      + Заметки
      + Задачи

*notes.org* - просто заметки или заметки к конкретной задаче, встречи;
*soeday.org* - несрочные задачи, в основном нерабочие, которые хотелось бы сделать, но не сейчас.

**** Процесс

С помощью org-capture добавляю задачу, письмо и т.п в inbox.org;
При разборе inbox.org принимаю решения куда дальше это задача попадет в projects.org или next_tasks.org. Если задача попала в projects.org, то разбиваю ее на подзадачи, если в next_tasks.org задача просто ждет своего часа. Также на этом шаге добавляю теги к задаче если они нужны;
Беру задачу в работу, переношу или делаю ссылку в journal.org. В journal.org в момент когда начинаю работу над задачей простовляю статус задачи и запускаю таймер, в конце дня, месяца и года строю таблицу затраченного времени.

*** Basic Config

Этот раздел содержит базовую конфигурацию =org-mode=, а также конфигурацию для повестоки дня.

#+begin_src emacs-lisp

  (use-package org
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)  ; Заметки с отметкой времени
    (setq org-log-into-drawer t)
    (when (system-is-windows)
      (setq org-agenda-files '(;; Файлы GTD
			       "c:/Users/user/Dropbox/GTD/next_tasks.org"
			       "c:/Users/user/Dropbox/GTD/projects.org"
			       "c:/Users/user/Dropbox/GTD/journal.org"
			       "c:/Users/user/Dropbox/GTD/agenda.org"
			       "c:/Users/user/Dropbox/GTD/waiting.org"))
      (set 'inbox_file "c:/Users/user/Dropbox/GTD/inbox.org"))
    (when (system-is-linux)
      (setq org-agenda-files '(;; Файлы GTD
			       "~/Dropbox/GTD/next_tasks.org"
			       "~/Dropbox/GTD/projects.org"
			       "~/Dropbox/GTD/journal.org"
			       "~/Dropbox/GTD/agenda.org"
			       "~/Dropbox/GTD/waiting.org"))
      (set 'inbox_file "~/Dropbox/GTD/inbox.org"))


    (setq org-refile-targets
	  '(("inbox.org" :maxlevel . 1)
	    ("projects.org" :maxlevel . 1)
	    ("journal.org" :maxlevel . 4)
	    ("someday.org" :maxlevel . 1)
	    ("next_tasks.org" :maxlevel . 1)
	    ("waiting.org" :maxlevel . 1)
	    ("agenda.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords '((sequence "TODO(t)"
					"IN-PROGRESS(s)"
					"PAUSE(p@/!)"
					"NEXT(n@)"
					"ACTIVE(a)"
					"WAITING(w@/!)""|" "DONE(d!)" "CANCEL(c@)")))
    (setq org-tag-alist
	  '((:startgroup)
					  ; Put mutually exclusive tags here
	    (:endgroup)
	    ("@home" . ?H)
	    ("@work" . ?W)
	    ("meeting" .?m)
	    ("day" . ?d)
	    ("projects" . ?p)
	    ("next" . ?n)
	    ("waiting" . ?g)
	    ("sprint" .?s)))

    (setq org-agenda-custom-commands
	  '(("d" "Dashboard"
	     ((agenda "" ((org-agenda-span 0)))
	      (tags-todo "+TODO=\"TODO\"-habits"
			 ((org-agenda-overriding-header "TODO")))
	      (todo "IN-PROGRESS"
		    ((org-agenda-overriding-header "IN-PROGRESS")))
	      (todo "WAITING"
		    ((org-agenda-overriding-header "WAITING")))
	      (todo "PAUSE"
		    ((org-agenda-overriding-header "PAUSE")))
	      (todo "NEXT"
		    ((org-agenda-overriding-header "Next")))))

	    ("w" "Workflow Status"
	     ((tags-todo "projects"
			 ((org-agenda-overriding-header "Projects")
			  (org-agenda-files org-agenda-files)))
	      (tags-todo "next"
			 ((org-agenda-overriding-header "Next")
			  (org-agenda-files org-agenda-files)))
	      (tags-todo "waiting"
			 ((org-agenda-overriding-header "Waiting")
			  (org-agenda-files org-agenda-files)))))
	    ("s" "Sprint"
	     ((tags-todo "sprint"
			 ((org-agenda-overriding-header "Sprint")
			  (org-agenda-files org-agenda-files)))))

	    ("i" "Inbox"
	     ((todo "TODO"))((org-agenda-files (list inbox_file))))

	    ;; Low-effort next actions
	    ("e" tags-todo "+TODO=\"TODO\"+Effort<15&+Effort>0"
	     ((org-agenda-overriding-header "Low Effort Tasks")
	      (org-agenda-max-todos 20)
	      (org-agenda-files org-agenda-files)))))

    (org-babel-do-load-languages
     'org-babel-load-languages
     '((python . t))))

  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c a") 'org-agenda)

#+end_src

*** Настройка org-protocol

=Org-mode= имеет удобную функцию =org-protocol=, которая связана с =org-capture=.

=Org-protocol= позволяет делать захват статей или их частей пряма из браузера.

Это позволяет при чтении чего-либо в браузере сохранить ссылку и выделеный текст прямо в =org= файл который Вы указали.

Для самой простой настройки Вам нужно сделать следующее:

1) В свой config GNU Emacs  добавить вызов функции =server-start= и пакет =org-protocol=;
2) Добавить шаблон захвата (=org-capture-templates=)

   Пример простого шаблона:
  #+begin_src text
    ("c" "org-protocol-capture" entry (file capture_file)
    "* TODO [[%:link][%:description]]\n\n %i"
    :immediate-finish t)
  #+end_src
3) В браузере котором Вы работаете настроить Bookmarklet для вызова следующего JS кода:
   #+begin_src js

     javascript:location.href ='org-protocol://capture?template=c&url='+
         encodeURIComponent(location.href) +
         '&title=' + encodeURIComponent(document.title) +
         '&body=' + encodeURIComponent(window.getSelection())

   #+end_src
4) Зарегестрировать =org-protocl= в своей системе:

   - Windows

     Нужно создать обычный текстовый файл и добавить в него следующие строки

      #+begin_src bash

        REGEDIT4

        [HKEY_CLASSES_ROOT\org-protocol]
        @="URL:Org Protocol"
        "URL Protocol"=""
        [HKEY_CLASSES_ROOT\org-protocol\shell]
        [HKEY_CLASSES_ROOT\org-protocol\shell\open]
        [HKEY_CLASSES_ROOT\org-protocol\shell\open\command]
        @="\"C:\\emacs\\bin\\emacsclientw.exe\" \"%1\""

      #+end_src

      после сохранить файл с расширением =reg= и запустить.

      *Обратите внимание что строка* @"\"C:\\emacs\\bin\\emacsclientw.exe\" \"%1\"" *может отличаться, в зависимости куда был установлен GNU Emacs*

   - Linux

     Еще не настраивал:)

[[https://orgmode.org/worg/org-contrib/org-protocol.html#org379cab0][Подробно про настройку можно почитать тут]]

