init.el

(defun et/transparent-frame (bool)
  (if bool
      (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
    (set-frame-parameter (selected-frame) 'alpha '(100 . 100))))

(et/transparent-frame t)

(add-to-list 'default-frame-alist '(alpha . (90 . 90)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(use-package golden-ratio
  :config
  (golden-ratio-mode 1))

(use-package highlight-indent-guides
  :hook ((prog-mode . highlight-indent-guides-mode)
         (prog-mode . hs-minor-mode))
  :config
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-responsive 'top))

(use-package org
  :config
  (setq org-ellipsis " ▾")
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)  ; Заметки с отметкой времени
  (setq org-log-into-drawer t)
  (when (system-is-windows)
    (setq org-agenda-files '(;; Файлы GTD
			     "c:/Users/user/Dropbox/GTD/next_tasks.org"
			     "c:/Users/user/Dropbox/GTD/projects.org"
			     "c:/Users/user/Dropbox/GTD/journal.org"
			     "c:/Users/user/Dropbox/GTD/agenda.org"
			     "c:/Users/user/Dropbox/GTD/waiting.org"))
    (set 'inbox_file "c:/Users/user/Dropbox/GTD/inbox.org"))
  (when (system-is-linux)
    (setq org-agenda-files '(;; Файлы GTD
			     "~/Dropbox/GTD/next_tasks.org"
			     "~/Dropbox/GTD/projects.org"
			     "~/Dropbox/GTD/journal.org"
			     "~/Dropbox/GTD/agenda.org"
			     "~/Dropbox/GTD/waiting.org"))
    (set 'inbox_file "~/Dropbox/GTD/inbox.org"))


  (setq org-refile-targets
	'(("inbox.org" :maxlevel . 1)
	  ("projects.org" :maxlevel . 1)
	  ("journal.org" :maxlevel . 4)
	  ("someday.org" :maxlevel . 1)
	  ("next_tasks.org" :maxlevel . 1)
	  ("waiting.org" :maxlevel . 1)
	  ("agenda.org" :maxlevel . 1)))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  (setq org-todo-keywords '((sequence "TODO(t)"
				      "IN-PROGRESS(s)"
				      "PAUSE(p@/!)"
				      "NEXT(n@)"
				      "ACTIVE(a)"
				      "WAITING(w@/!)""|" "DONE(d!)" "CANCEL(c@)")))
  (setq org-tag-alist
	'((:startgroup)
					; Put mutually exclusive tags here
	  (:endgroup)
	  ("@home" . ?H)
	  ("@work" . ?W)
	  ("meeting" .?m)
	  ("day" . ?d)
	  ("projects" . ?p)
	  ("next" . ?n)
	  ("waiting" . ?g)
	  ("sprint" .?s)))

  (setq org-agenda-custom-commands
	'(("d" "Dashboard"
	   ((agenda "" ((org-agenda-span 0)))
	    (tags-todo "+TODO=\"TODO\"-habits"
		       ((org-agenda-overriding-header "TODO")))
	    (todo "IN-PROGRESS"
		  ((org-agenda-overriding-header "IN-PROGRESS")))
	    (todo "WAITING"
		  ((org-agenda-overriding-header "WAITING")))
	    (todo "PAUSE"
		  ((org-agenda-overriding-header "PAUSE")))
	    (todo "NEXT"
		  ((org-agenda-overriding-header "Next")))))

	  ("w" "Workflow Status"
	   ((tags-todo "projects"
		       ((org-agenda-overriding-header "Projects")
			(org-agenda-files org-agenda-files)))
	    (tags-todo "next"
		       ((org-agenda-overriding-header "Next")
			(org-agenda-files org-agenda-files)))
	    (tags-todo "waiting"
		       ((org-agenda-overriding-header "Waiting")
			(org-agenda-files org-agenda-files)))))
	  ("s" "Sprint"
	   ((tags-todo "sprint"
		       ((org-agenda-overriding-header "Sprint")
			(org-agenda-files org-agenda-files)))))

	  ("i" "Inbox"
	   ((todo "TODO"))((org-agenda-files (list inbox_file))))

	  ;; Low-effort next actions
	  ("e" tags-todo "+TODO=\"TODO\"+Effort<15&+Effort>0"
	   ((org-agenda-overriding-header "Low Effort Tasks")
	    (org-agenda-max-todos 20)
	    (org-agenda-files org-agenda-files)))))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t))))

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)

(when (system-is-windows)
