myconfig.org
*** Capture

Я использую  =capture= для быстрого создания задач, заметок и другой организации дел.

На данный момент =capture= связан с =org-protocl=, смотрите пункт выше.

#+begin_src emacs-lisp

  (when (system-is-windows)
    (set 'gtd_inbox_file "c:/Users/user/Dropbox/GTD/inbox.org")
    (set 'gtd_journal_filel "c:/Users/user/Dropbox/GTD/journal.org")
    (set 'gtd_agenda_filel "c:/Users/user/Dropbox/GTD/agenda.org")
    (set 'gtd_notes_filel "c:/Users/user/Dropbox/GTD/notes.org")
    (set 'gtd_projects_filel "c:/Users/user/Dropbox/GTD/projects.org")
    (set 'gtd_someday_filel "c:/Users/user/Dropbox/GTD/someday.org")
    (set 'gtd_next_tasks_file "c:/Users/user/Dropbox/GTD/next_tasks.org")
    (set 'gtd_waiting_file "c:/Users/user/Dropbox/GTD/waiting.org"))
  (when (system-is-linux)
    (set 'inbox_file "~/Dropbox/GTD/inbox.org")
    (set 'journal_filel "~/Dropbox/GTD/journal.org")
    (set 'gtd_agenda_filel "~/Dropbox/GTD/agenda.org")
    (set 'gtd_notes_filel "~/Dropbox/GTD/notes.org")
    (set 'gtd_projects_filel "~/Dropbox/GTD/projects.org")
    (set 'gtd_someday_filel "~/Dropbox/GTD/someday.org")
    (set 'gtd_next_tasks_file "~/Dropbox/GTD/next_tasks.org")
    (set 'gtd_waiting_file "~/Dropbox/GTD/waiting.org"))

  (server-start)
  (require 'org-protocol)

  (setq org-capture-templates
	'(;; Захват задач в файл Inbox
	  ("i" "Inbox task")
	  ("ii" "Just a task (просто задача)" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO %?\n Entered on %U")
	  ("il" "Task with a link to a file (задача с ссылкой на файл))" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO %?\n Entered on %U \n %a")
	  ("im" "Meeting (собрание)" entry (file+olp gtd_agenda_filel "Future")
	   "* TODO %? :meeting: \n %^t %i")
	  ("is" "Schedule a task (запланировать задачу)" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO %? %^G \n SCHEDULED: %^t %i")
	  ("id" "Task with a deadline (задача с дедлайном)" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO %? %^G \n DEADLINE: %^t %i")
	  ;; Журнал дня
	  ("j" "Journal Entries")
	  ("jj" "Journal" entry (file+function gtd_journal_filel
					       (lambda ()
						 (org-datetree-find-date-create
						  (org-date-to-gregorian (org-today)) t)
						 (re-search-forward "^\\*.+ Day" nil t)))
	   "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n")
	  ("jd" "Tasks for the day" entry
	   (file+olp+datetree gtd_journal_filel)
	   "\n* Day \n* Meeting :meeting: \n* %<%Y-%m-%d %p> - Tasks for the day")
	  ;; Заметки
	  ("n" "Note")
	  ("nn" "Note with link" entry  (file gtd_notes_filel)
	   "* Note (%a)\n Entered on/ %U\n %?")
	  ("nj" "Just a note" entry  (file gtd_notes_filel)
	    "* Note %?\n  Entered on/ %U\n")
	  ;; Захват задач из внешних источников (браузер)
	  ("c" "org-protocol-capture" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO [[%:link][%:description]]\n\n %i"
	   :immediate-finish t)
	  ;; Захват выделенного региона, используеться в функции et/org-capture-inbox
	  ("e" "capturing a selected region" entry (file+olp gtd_inbox_file "Inbox")
	   "* TODO %?\n %a\n %i"
	   :immediate-finish t)))

  (defun et/org-capture-inbox ()
    "Записать выделенный регион в файл Inbox"
    (interactive)
    (org-capture nil "e"))

#+end_src

*** Org-roam

[[https://www.orgroam.com/][Org-roam]] - это система для управления вашими знаниями на основе org файлов. Удобный способ создать собственную wiki или просто управлять своими заметками.

**** Установка

***** Windows

Чтобы установить org-roam на OS Windows, Вам нужно устоновить компилятор =C= [[https://www.msys2.org/][MSYS2]] и в его терминале ввести команду:

#+begin_src bash

  pacman -S gcc

#+end_src

Далее нужно добавить пути, для этого в терминале введем следующие:

#+begin_src bash

  setx PATH "c:\msys64\mingw32\bin;c:\msys64\usr\bin;%PATH%"

#+end_src

Чтобы узнать подробней читайте [[https://www.orgroam.com/manual.html#C-Compiler][инструкцию]].

***** Linux

Еще не настроено:)

**** Commands

| command                             | key / ex command | description                              |
|-------------------------------------+------------------+------------------------------------------|
| org-roam-node-find                  | =C-c n f=        | открыть/создать узел                     |
| org-roam-node-insert                | =C-c n i=        | добавить ссылку на узел                  |
| org-roam-buffer-toggle              | =C-c n l=        | посмотреть связи между узлами            |
| completion-at-point                 | =C-M-i=          | автозавершение при вводе первых символов |
| org-id-get-create                   | -                | создать узел из заголовка                |
| org-roam-alias-add                  | -                | добавить alias узлу                      |
| org-roam-dailies-capture-today      | =C-c n d n=      | создать заметку на текущий день          |
| org-roam-dailies-goto-today         | =C-c n d d=      | перейти к заметкам текущего дня          |
| org-roam-dailies-capture-yesterday  | =C-c n d Y=      | создать заметку вчерашнего дня           |
| org-roam-dailies-capture-tomorrow   | =C-c n d T=      | создать заметку завтрашнего дня          |
| org-roam-dailies-capture-date       | =C-c n d v=      | создать заметку на определенную дату     |
| org-roam-dailies-goto-date          | =C-c n d c=      | перейти к файлу за конкретную дату       |
| org-roam-dailies-goto-next-note     | =C-c n d b=      | перейти к заметки вчерашнего дня         |
| org-roam-dailies-goto-previous-note | =C-c n d f=      | перейти к заметку завтрашнего дня        |
|-------------------------------------+------------------+------------------------------------------|

**** Settings

#+begin_src emacs-lisp

  (when (system-is-windows)
    (set 'path_org_roam "c:/Users/user/Dropbox/Braindump/main"))
  (when (system-is-linux)
    (set 'path_org_roam "~/Dropbox/Braindump/main"))

  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory path_org_roam)
    (org-roam-completion-everywhere t)
    :bind (("C-c n l" . org-roam-buffer-toggle)
	   ("C-c n f" . org-roam-node-find)
	   ("C-c n i" . org-roam-node-insert)
	   :map org-mode-map
	   ("C-M-i" . completion-at-point)
	   :map org-roam-dailies-map
	   ("Y" . org-roam-dailies-capture-yesterday)
	   ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    (org-roam-db-autosync-mode)
    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE."
      (condition-case nil
	  (file-name-nondirectory
	   (directory-file-name
	    (file-name-directory
	     (file-relative-name (org-roam-node-file node) org-roam-directory))))
	(error ""))))

#+end_src

*** Org-roam-ui

GitHub: [[https://github.com/org-roam/org-roam-ui][org-roam-ui]]

=org-roam-ui= — это интерфейс для просмотра и взаимодействия с вашими заметками в [[https://github.com/EgorTolbaev/.emacs.d/blob/master/myconfig.org#Org-roam][Org-roam]].

Используйте =M-x org-roam-ui-mode RET= для включения глобального режима. Он запустит веб-сервер по адресу http://127.0.0.1:35901/ и подключится к нему через WebSocket для получения обновлений в реальном времени.

#+begin_src emacs-lisp

  (use-package org-roam-ui
    :after org-roam
    ;;normally we'd recommend hooking orui after org-roam, but since org-roam does not have
    ;;a hookable mode anymore, you're advised to pick something yourself
    ;;if you don't care about startup time, use
    ;;:hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

#+end_src

*** Org bullets

Github: [[https://github.com/sabof/org-bullets][org-bullets]]

=org-bullets= заменяет звездочки заголовков в буферах режима организации более красивыми символами.

#+begin_src emacs-lisp

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Center Org Buffers

Github: [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]]

Мне нравится когда файл в режим =org-mode= центрируется в буфере.

#+begin_src emacs-lisp

  (when (system-is-windows)
    (set 'center_org 130))
  (when (system-is-linux)
    (set 'center_org 150))

  (defun et/org-mode-visual-fill ()
      (setq visual-fill-column-width center_org
            visual-fill-column-center-text t)
      (visual-fill-column-mode 1))

    (use-package visual-fill-column
      :hook (org-mode . et/org-mode-visual-fill))

#+end_src

*** Toc org

GitHub: [[https://github.com/snosov1/toc-org][toc-org]]


Удобный способ делать оглавления автоматически, просто в первом заголовке добавить тег :TOC:

#+begin_src emacs-lisp

  (use-package toc-org
    :after org
    :hook (org-mode . toc-org-enable))

#+end_src

*** Block Templates

Шаблоны позволяют вводить что-то вроде, =<el=, затем при нажатии =Tab= разворачиваеться шаблон.

#+begin_src emacs-lisp

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("cs" . "src csharp"))

#+end_src

