init.el
  (set 'gtd_inbox_file "c:/Users/user/Dropbox/GTD/inbox.org")
  (set 'gtd_journal_filel "c:/Users/user/Dropbox/GTD/journal.org")
  (set 'gtd_agenda_filel "c:/Users/user/Dropbox/GTD/agenda.org")
  (set 'gtd_notes_filel "c:/Users/user/Dropbox/GTD/notes.org")
  (set 'gtd_projects_filel "c:/Users/user/Dropbox/GTD/projects.org")
  (set 'gtd_someday_filel "c:/Users/user/Dropbox/GTD/someday.org")
  (set 'gtd_next_tasks_file "c:/Users/user/Dropbox/GTD/next_tasks.org")
  (set 'gtd_waiting_file "c:/Users/user/Dropbox/GTD/waiting.org"))
(when (system-is-linux)
  (set 'inbox_file "~/Dropbox/GTD/inbox.org")
  (set 'journal_filel "~/Dropbox/GTD/journal.org")
  (set 'gtd_agenda_filel "~/Dropbox/GTD/agenda.org")
  (set 'gtd_notes_filel "~/Dropbox/GTD/notes.org")
  (set 'gtd_projects_filel "~/Dropbox/GTD/projects.org")
  (set 'gtd_someday_filel "~/Dropbox/GTD/someday.org")
  (set 'gtd_next_tasks_file "~/Dropbox/GTD/next_tasks.org")
  (set 'gtd_waiting_file "~/Dropbox/GTD/waiting.org"))

(server-start)
(require 'org-protocol)

(setq org-capture-templates
      '(;; Захват задач в файл Inbox
	("i" "Inbox task")
	("ii" "Just a task (просто задача)" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO %?\n Entered on %U")
	("il" "Task with a link to a file (задача с ссылкой на файл))" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO %?\n Entered on %U \n %a")
	("im" "Meeting (собрание)" entry (file+olp gtd_agenda_filel "Future")
	 "* TODO %? :meeting: \n %^t %i")
	("is" "Schedule a task (запланировать задачу)" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO %? %^G \n SCHEDULED: %^t %i")
	("id" "Task with a deadline (задача с дедлайном)" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO %? %^G \n DEADLINE: %^t %i")
	;; Журнал дня
	("j" "Journal Entries")
	("jj" "Journal" entry (file+function gtd_journal_filel
					     (lambda ()
					       (org-datetree-find-date-create
						(org-date-to-gregorian (org-today)) t)
					       (re-search-forward "^\\*.+ Day" nil t)))
	 "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n")
	("jd" "Tasks for the day" entry
	 (file+olp+datetree gtd_journal_filel)
	 "\n* Day \n* Meeting :meeting: \n* %<%Y-%m-%d %p> - Tasks for the day")
	;; Заметки
	("n" "Note")
	("nn" "Note with link" entry  (file gtd_notes_filel)
	 "* Note (%a)\n Entered on/ %U\n %?")
	("nj" "Just a note" entry  (file gtd_notes_filel)
	  "* Note %?\n  Entered on/ %U\n")
	;; Захват задач из внешних источников (браузер)
	("c" "org-protocol-capture" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO [[%:link][%:description]]\n\n %i"
	 :immediate-finish t)
	;; Захват выделенного региона, используеться в функции et/org-capture-inbox
	("e" "capturing a selected region" entry (file+olp gtd_inbox_file "Inbox")
	 "* TODO %?\n %a\n %i"
	 :immediate-finish t)))

(defun et/org-capture-inbox ()
  "Записать выделенный регион в файл Inbox"
  (interactive)
  (org-capture nil "e"))

(when (system-is-windows)
  (set 'path_org_roam "c:/Users/user/Dropbox/Braindump/main"))
(when (system-is-linux)
  (set 'path_org_roam "~/Dropbox/Braindump/main"))

(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory path_org_roam)
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
	 ("C-c n f" . org-roam-node-find)
	 ("C-c n i" . org-roam-node-insert)
	 :map org-mode-map
	 ("C-M-i" . completion-at-point)
	 :map org-roam-dailies-map
	 ("Y" . org-roam-dailies-capture-yesterday)
	 ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode)
  (cl-defmethod org-roam-node-type ((node org-roam-node))
    "Return the TYPE of NODE."
    (condition-case nil
	(file-name-nondirectory
	 (directory-file-name
	  (file-name-directory
	   (file-relative-name (org-roam-node-file node) org-roam-directory))))
      (error ""))))

(use-package org-roam-ui
  :after org-roam
  ;;normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;a hookable mode anymore, you're advised to pick something yourself
  ;;if you don't care about startup time, use
  ;;:hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(when (system-is-windows)
  (set 'center_org 130))
(when (system-is-linux)
  (set 'center_org 150))

(defun et/org-mode-visual-fill ()
    (setq visual-fill-column-width center_org
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . et/org-mode-visual-fill))

(use-package toc-org
  :after org
  :hook (org-mode . toc-org-enable))

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("cs" . "src csharp"))
