myconfig.org
*** Quick file access

В этом разделе собраны функции для быстрого доступа к файлам которые мне часто нужны.

#+begin_src emacs-lisp

  (defun et/open-inbox ()
    "Открыть файл Inbox"
    (interactive)
    (find-file gtd_inbox_file))

  (defun et/open-agenda ()
    "Открыть файл Agenda"
    (interactive)
    (find-file gtd_agenda_filel))

  (defun et/open-journal ()
    "Открыть файл Journal"
    (interactive)
    (find-file gtd_journal_filel))

  (defun et/open-notes ()
    "Открыть файл Notes"
    (interactive)
    (find-file gtd_notes_filel))

  (defun et/open-projects ()
    "Открыть файл Projects"
    (interactive)
    (find-file gtd_projects_filel))

  (defun et/open-someday ()
    "Открыть файл Someday"
    (interactive)
    (find-file gtd_someday_filel))

  (defun et/open-next-tasks ()
    "Открыть файл Someday"
    (interactive)
    (find-file gtd_next_tasks_file))

  (defun et/open-waiting ()
    "Открыть файл Someday"
    (interactive)
    (find-file gtd_waiting_file))

#+end_src
*** Auto-tangle Configuration Files

Каждый раз при сохранении =myconfig.org= экспортирует конфигурацию в =init.el=

#+begin_src emacs-lisp

  (when (system-is-windows)
    (defvar et/path-expand "./myconfig.org"))
  (when (system-is-linux)
    (defvar et/path-expand "~/.emacs.d/myconfig.org"))

  (defun et/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name et/path-expand))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'et/org-babel-tangle-config)))

#+end_src

** Markdown

[[https://jblevins.org/projects/markdown-mode/][Markdown Mode for GNU Emacs]]

Прежде чем использовать этот пакет, нужно убедиться что установлен какой то процессор Markdown

В моем конфиге это - [[https://github.com/jgm/pandoc][pandoc]]

#+begin_src emacs-lisp

  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "pandoc"))

#+end_src

* File Management

** Dired

Dired - это встроенный файловый менеджер для GNU Emacs.

/В OS Windows может быть не корректная сортировка файлов и дополнительная информация, это неприятно, но работе не мешает./

Для отображения icons в =Dired= использую [[#treemacs-icons][Treemacs Icons]].

*** Commands

| command    | key / ex command | description                  |
|------------+------------------+------------------------------|
| dired      | =C-x d=          | открыть                      |
| dired-jump | =C-x C-j=        | открыть dired текущего файла |
|------------+------------------+------------------------------|

=dired-single=

| command                   | key / ex command | description                      |
|---------------------------+------------------+----------------------------------|
| dired-single-up-directory | =h=              | вернуться назад в текущем буфере |
| dired-single-buffer       | =j=              | открыть в текущем буфере         |
|---------------------------+------------------+----------------------------------|

**** Навигация

| command                      | key / ex command | description                                 |
|------------------------------+------------------+---------------------------------------------|
| dired-next-line              | =n=              | cледующая строка                            |
| dired-previous-line          | =p=              | предыдущая строка                           |
| dired-goto-file              | =j=              | перейти к файлу в буфере                    |
| dired-find-file              | =RET=            | выберите файл или каталог                   |
| dired-up-directiry           | =^=              | перейти в родительский каталог              |
| dired-find-file-other-window | =o=              | открыть файл в «другом» окне                |
| dired-display-file           | =C-o=            | показать файл в другом окне без фокусировки |
| dired-view-file              | =v=              | предварительный просмотр                    |
| revert-buffer                | =g=              | обновить буфер                              |
|------------------------------+------------------+---------------------------------------------|

**** Маркировка файлов

| command                 | key / ex command | description                                             |
|-------------------------+------------------+---------------------------------------------------------|
| dired-mark              | =m=              | отметить файл                                           |
| dired-unmark            | =u=              | снять отметку                                           |
| dired-unmark-all-marks  | =U=              | снять отметку со всех файлов                            |
| dired-toggle-marks      | =* t= or =t=     | Инвертирует отмеченные файлы в буфере                   |
| dired-mark-files-regexp | =% m=            | Пометить файлы в буфере с помощью регулярного выражения |
|                         | =*=              | Множество других функций автоматической маркировки      |
| dired-do-kill-lines     | =k=              | «Убить» отмеченные предметы                             |
|-------------------------+------------------+---------------------------------------------------------|

**** Копирование и переименование файлов

| command                | key / ex command | description                                         |
|------------------------+------------------+-----------------------------------------------------|
| dired-do-copy          | =C=              | скопировать файл                                    |
| dired-do-rename        | =R=              | переименовать файл                                  |
| dired-do-rename-regexp | =% R=            | Переименовать на основе регулярного выражения ^test |
|------------------------+------------------+-----------------------------------------------------|

**** Удаление файлов

| command                   | key / ex command | description                    |
|---------------------------+------------------+--------------------------------|
| dired-do-delete           | =D=              | Удалить отмеченный файл        |
| dired-flag-file-deletion  | =d=              | Отметить файл для удаления     |
| dired-do-flagged-delete   | =x=              | Выполнить удаление для отметок |
| delete-by-moving-to-trash | -                | Переместить в корзину          |
|---------------------------+------------------+--------------------------------|

**** Создание и распаковка архивов

| command                    | key / ex command | description                                       |
|----------------------------+------------------+---------------------------------------------------|
| dired-do-compress          | =Z=              | Сжать или распаковать файл или папку в ( .tar.gz) |
| dired-do-compress          | =c=              | Сжать выделение в конкретный файл                 |
| dired-compress-files-alist | -                | Привязать команды сжатия к расширению файла       |
|----------------------------+------------------+---------------------------------------------------|

**** Другие общие операции

| command          | key / ex command | description                                |
|------------------+------------------+--------------------------------------------|
| dired-do-touch   | =T=              | Коснитесь (изменить отметку времени)       |
| dired-do-chmod   | =M=              | Изменить режим файла                       |
| dired-do-chown   | =O=              | Сменить владельца файла                    |
| dired-do-chgrp   | =G=              | Изменить группу файлов                     |
| dired-do-symlink | =S=              | Создайте символическую ссылку на этот файл |
| dired-do-load    | =L=              | Загрузить файл GNU Emacs Lisp в GNU Emacs  |
|------------------+------------------+--------------------------------------------|


*** Settings

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (define-key dired-mode-map "h"
      'dired-single-up-directory)
    (define-key dired-mode-map "l"
      'dired-single-buffer))

  (use-package dired-single)

  ;; (use-package all-the-icons-dired
  ;;   :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

** Deft

GitHub: [[https://github.com/jrblevin/deft][Deft]]

Deft — это режим GNU Emacs для быстрого просмотра, фильтрации и редактирования каталогов простых текстовых заметок, вдохновленный Notational Velocity.

*** Commands

| command                        | key / ex command | description                                                  |
|--------------------------------+------------------+--------------------------------------------------------------|
| deft-open-file-other-window    | =C-o=            | открыть файл в другом окне не меня фокуса                    |
| deft-open-file-other-window    | =C-u C-o=        | открыть файл в другом окне переключившись на него            |
| deft-filter-clear              | =С-с С-с=        | очистить фильтр поиска                                       |
| deft-filter                    | =C-c C-l=        | редактировать строку поиска                                  |
|                                | =M-p= and =M-n=  | история поиска в режиме редактирования строки поиска         |
| deft-toggle-incremental-search | =C-c C-t=        | переключение между обычным поиском и по регулярным выражения |
| deft-rename-file               | =C-c C-r=        | переименовать файл                                           |
| deft-delete-file               | =С-с С-d=        | удалить файл                                                 |
| deft-new-file                  | =C-c C-n=        | создать файл                                                 |
| deft-archive-file              | =C-c C-a=        | переместить файл в архив                                     |
|                                | =C-c C-q=        | закрыть deft                                                 |
|--------------------------------+------------------+--------------------------------------------------------------|

*** Settings

#+begin_src emacs-lisp

  (when (system-is-windows)
    (setq et/deft-dir-list '("c:/Users/user/Dropbox/Braindump/main"
                             "c:/Users/user/Dropbox/GTD/")))
  (when (system-is-linux)
    (setq et/deft-dir-list '("~/Dropbox/Braindump/main"
                             "~/Dropbox/GTD/")))

  (use-package deft
    :config (setq deft-directory "c:/Users/user/Dropbox/Braindump/main"
                  deft-extensions '("md" "org"))
    (setq deft-use-filename-as-title t))

  (defun et/pick-deft-dir ()
    "Select directories from a list"
    (interactive)
    (setq deft-directory
          (ido-completing-read "Select directory: " et/deft-dir-list))
    (deft-refresh))

#+end_src
* Modes
** IVY

[[https://github.com/abo-abo/swiper/tree/7cdde66c95d5205287e88010bc7a3a978c931db0][Ivy]] - это общий механизм завершения для GNU Emacs. Использую в месте с [[https://github.com/EgorTolbaev/.emacs.d/blob/master/myconfig.org#ivy-rich][ivy-rich]] и [[https://github.com/EgorTolbaev/.emacs.d/blob/master/myconfig.org#counsel][counsel]]

*** Commands

| command                | key / ex command | description                     |
|------------------------+------------------+---------------------------------|
| swiper                 | =C-s=            | открыть поиск                   |
| ivy-alt-done           | =TAB= or =C-l=   | выйти из буфера                 |
| ivy-next-line          | =С-j= or =C-n=   | cледующая строка                |
| ivy-previous-line      | =C-k= or =C-p=   | предыдущая строка               |
| ivy-switch-buffer-kill | =C-d=            | выти из буфера reverse-i-search |
| counsel-switch-buffer  | =C-M-j=          | переключение буферов с превью   |
|------------------------+------------------+---------------------------------|

