init.el

(defun et/open-inbox ()
  "Открыть файл Inbox"
  (interactive)
  (find-file gtd_inbox_file))

(defun et/open-agenda ()
  "Открыть файл Agenda"
  (interactive)
  (find-file gtd_agenda_filel))

(defun et/open-journal ()
  "Открыть файл Journal"
  (interactive)
  (find-file gtd_journal_filel))

(defun et/open-notes ()
  "Открыть файл Notes"
  (interactive)
  (find-file gtd_notes_filel))

(defun et/open-projects ()
  "Открыть файл Projects"
  (interactive)
  (find-file gtd_projects_filel))

(defun et/open-someday ()
  "Открыть файл Someday"
  (interactive)
  (find-file gtd_someday_filel))

(defun et/open-next-tasks ()
  "Открыть файл Someday"
  (interactive)
  (find-file gtd_next_tasks_file))

(defun et/open-waiting ()
  "Открыть файл Someday"
  (interactive)
  (find-file gtd_waiting_file))

(when (system-is-windows)
  (defvar et/path-expand "./myconfig.org"))
(when (system-is-linux)
  (defvar et/path-expand "~/.emacs.d/myconfig.org"))

(defun et/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name et/path-expand))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'et/org-babel-tangle-config)))

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "pandoc"))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (define-key dired-mode-map "h"
    'dired-single-up-directory)
  (define-key dired-mode-map "l"
    'dired-single-buffer))

(use-package dired-single)

;; (use-package all-the-icons-dired
;;   :hook (dired-mode . all-the-icons-dired-mode))

(when (system-is-windows)
  (setq et/deft-dir-list '("c:/Users/user/Dropbox/Braindump/main"
                           "c:/Users/user/Dropbox/GTD/")))
(when (system-is-linux)
  (setq et/deft-dir-list '("~/Dropbox/Braindump/main"
                           "~/Dropbox/GTD/")))

(use-package deft
  :config (setq deft-directory "c:/Users/user/Dropbox/Braindump/main"
                deft-extensions '("md" "org"))
  (setq deft-use-filename-as-title t))

(defun et/pick-deft-dir ()
  "Select directories from a list"
  (interactive)
  (setq deft-directory
        (ido-completing-read "Select directory: " et/deft-dir-list))
  (deft-refresh))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
