myconfig.org
*** Settings

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (global-set-key (kbd "C-M-j") 'counsel-switch-buffer)

#+end_src

** IVY-RICH

#+begin_src emacs-lisp

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

#+end_src

** COUNSEL

#+begin_src emacs-lisp

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
          :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))

#+end_src

** Helpful

GitHub: [[https://github.com/Wilfred/helpful][helpful]]

Helpful - это альтернатива встроенной справке GNU Emacs, которая предоставляет гораздо больше контекстной информации.

#+begin_src emacs-lisp

  (use-package helpful
    :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
    :bind
      ([remap describe-function] . counsel-describe-function)
      ([remap describe-command] . helpful-command)
      ([remap describe-variable] . counsel-describe-variable)
      ([remap describe-key] . helpful-key))

#+end_src

** Which Key

GitHub: [[https://github.com/justbur/emacs-which-key][which-key]]

which-key- это второстепенный режим для GNU Emacs, который отображает привязки клавиш после введенной вами неполной команды (префикса) во всплывающем окне.

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
      (setq which-key-idle-delay 1))

#+end_src

* General packages

** BS

GitHub: [[https://github.com/emacs-mirror/emacs/blob/master/lisp/bs.el][bs]]

Меню для выбора и отображения буферов

#+begin_src emacs-lisp

  (use-package bs)

  ;; Добавим чтобы в буфере всегда был scratch
  (setq bs-configurations
      '(("files" "^\\*scratch\\*" nil nil bs-visits-non-file bs-sort-buffer-interns-are-last)))

  (global-set-key (kbd "<f2>") 'bs-show)

#+end_src

** Dashboard

GitHub: [[https://github.com/emacs-dashboard/emacs-dashboard][dashboard]]

Расширяемый стартовый экран GNU Emacs.

#+begin_src emacs-lisp

  (use-package dashboard
    :init
    (progn
      (setq dashboard-startup-banner "~/.emacs.d/images/ET_Light_Small.png")
      (setq dashboard-items '((recents  . 5)
                              (projects . 5)
                              (agenda . 5)))
      (setq dashboard-show-shortcuts nil)
      (setq dashboard-center-content t)
      (setq dashboard-set-file-icons t)
      (setq dashboard-set-heading-icons t)
      (setq dashboard-set-init-info t ))
    :config
    (dashboard-setup-startup-hook)
    :custom
    (dashboard-banner-logo-title "Good Hack")
    ;; Кнопки навигации
    (dashboard-set-navigator t)
    (dashboard-navigator-buttons
     (if (featurep 'all-the-icons)
         `(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
             "Homepage" "Browse homepage"
             (lambda (&rest _) (browse-url "https://github.com/EgorTolbaev")))
            (,(all-the-icons-fileicon "elisp" :height 1.1 :v-adjust -0.1)
             "Configuration" "" (lambda (&rest _) (edit-configs)))))
       `((("" "Homepage" "Browse homepage"
           (lambda (&rest _) (browse-url "https://github.com/EgorTolbaev")))
          ("" "Configuration" "" (lambda (&rest _) (edit-configs)))))))
    ;; Настройки dashboard-agenda для показа с определенным тегом и статусом
    (dashboard-filter-agenda-entry 'dashboard-filter-agenda-by-todo)
    (dashboard-match-agenda-entry "day|@work"
      dashboard-match-next-entry "TODO=\"TODO\"|TODO=\"IN-PROGRESS\"|TODO=\"PAUSE\""))

#+end_src

** Reverse-im

GitHub: [[https://github.com/emacsmirror/reverse-im][reverse-im]]

Переопределяет функциональную-клавишную-карту для предпочтительных методов ввода для перевода входных последовательностей на английский язык.

#+begin_src emacs-lisp

  (use-package reverse-im
    :custom
      (reverse-im-input-methods '("russian-computer"))
    :config
      (reverse-im-mode t))

#+end_src

** Browser

Я решил использовать в связке с GNU Emacs браузер, ориентированный на клавиатуру, с минимальным графическим интерфейсом [[https://github.com/qutebrowser/qutebrowser][Qutebrowser]]

При установки qutebrowser на Windows возможно потребуеться вручную добавить путь в переменную $path = C:\Program Files\qutebrowser

#+begin_src emacs-lisp

  (use-package browse-url
    :ensure nil
    :custom
      (browse-url-browser-function 'browse-url-generic)
      (browse-url-generic-program "qutebrowser"))

#+end_src

*** Engine-mode

Github: [[https://github.com/hrs/engine-mode/tree/e0910f141f2d37c28936c51c3c8bb8a9ca0c01d1][engine-mode]]

Удобный способ совершать поиск не выходя из GNU Emacs

**** Commands

| command                     | key / ex command | description             |
|-----------------------------+------------------+-------------------------|
| engine/keymap-prefix        | =C-x /=          | открыть буфер команд    |
| engine/search-duckduckgo    | =C-x / d=        | поиск в duckduckgo      |
| engine/search-github        | =C-x / g=        | поиск в GitHub          |
| engine/search-google-images | =C-x / i=        | поиск картинок в google |
| engine/search-youtube       | =C-x / y=        | поиск в youtube         |
|-----------------------------+------------------+-------------------------|


**** Settings

#+begin_src emacs-lisp

  (use-package engine-mode
    :defer 3
    :config
      (defengine duckduckgo
        "https://duckduckgo.com/?q=%s"
	:keybinding "d")

      (defengine github
        "https://github.com/search?ref=simplesearch&q=%s"
	:keybinding "g")

      (defengine google-images
        "http://www.google.com/images?hl=en&source=hp&biw=1440&bih=795&gbv=2&aq=f&aqi=&aql=&oq=&q=%s"
	:keybinding "i")

      (defengine youtube
        "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
	:keybinding "y")

    (engine-mode t))

#+end_src

** Hydra

GitHub: [[https://github.com/abo-abo/hydra][hydra]], [[https://github.com/jerrypnz/major-mode-hydra.el][major-mode-hydra]]

=hydra= позволяет сделать меню с командами и всплывающем окне отображать их. Это удобно когда вам нужно группировать команды или просто не запоменать все хоткеии, а подсматривать в подсказку.

