myconfig.org
*** Commands

| command                     | key / ex command     | description                     |
|-----------------------------+----------------------+---------------------------------|
| Браузер                     |                      |                                 |
| hydra-browser/body          | =C-c b=              | hydra браузера                  |
| engine/search-duckduckgo    | =C-c b d=            | поиск в duckduckgo              |
| engine/search-google-images | =C-c b i=            | поиск картинок в google         |
| engine/search-youtubes      | =C-c b y=            | поиск в youtube                 |
| engine/search-githu         | =C-c b g=            | поиск в GitHub                  |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| Treemacs                    |                      |                                 |
| hydra-treemacs/body         | =C-c t=              | hydra treemac                   |
| treemacs                    | =C-c t t=            | treemac                         |
| lsp-treemacs-symbols        | =C-c t s=            | treemacs ymbols                 |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| Настройка темы              |                      |                                 |
| hydra-theme/body            | =C-c s=              | hydra theme                     |
| counsel-load-theme          | =C-c s a=            | посмотреть все темы             |
| set-night-theme             | =C-c s d=            | установить темную тему          |
| set-light-theme             | =C-c s l=            | установить светлую тему         |
| (et/transparent-frame t)    | =C-c s p=            | прозрачный фрейм                |
| (et/transparent-frame nil)  | =C-c s n=            | не прозрачный фрейм             |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| Org                         |                      |                                 |
| hydra-org/body              | =C-c o=              | hydra org                       |
| org-insert-link-global      | =C-c o g=            | созадать ссылку                 |
| org-store-link              | =C-c o l=            | store link                      |
| org-capture                 | =C-c o c=            | создать заметку                 |
| org-agenda                  | =C-c o a=            | открыть agenda                  |
| org-clock-goto              | =C-c o j=            | перейти к задаче                |
| org-clock-in-last           | =C-c o d=            | повторный запуск времени задачи |
| org-clock-in                | =C-c o i=            | запустить время выполнения      |
| org-clock-out               | =C-c o o=            | остановить время выполнения     |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| Windows                     |                      |                                 |
| hydra-windows/body          | =C-c w=              | hydra windows                   |
| golden-ratio-mode           | =C-c w g=            | включить/отключить golden ratio |
| balance-windows             | =C-c w b= or =C-x += | сбалансировать размер всех окон |
| shrink-window               | =C-c w s=            | уменьшить окно по вертикали     |
| shrink-window-horizontally  | =C-c w [= or =C-x {= | уменьшить окно по горизонтали   |
| enlarge-window-horizontally | =C-c w ]= or =C-x }= | увеличить окно по горизонтали   |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| Text                        |                      |                                 |
| hydra-text-scale/body       | =C-c T=              | hydra text                      |
| text-scale-increase         | =C-c T j=            | увеличить текст                 |
| text-scale-decrease         | =C-c T k=            | уменьшить текст                 |
|-----------------------------+----------------------+---------------------------------|
|-----------------------------+----------------------+---------------------------------|
| File GTD                    |                      |                                 |
| hydra-file-gtd/body         | =C-c g=              | hydra File GTD                  |
| et/open-inbox               | =C-c g i=            | открыть фийл Inbox              |
| et/open-agenda              | =C-c g a=            | открыть фийл Agenda             |
| et/open-journal             | =C-c g j=            | открыть фийл Journal            |
| et/open-notes               | =C-c g n=            | открыть фийл Note               |
| et/open-projects            | =C-c g p=            | открыть фийл Projects           |
| et/open-someday             | =C-c g s=            | открыть фийл Someday            |
| et/open-next-tasks          | =C-c g t=            | открыть фийл Next task          |
| et/open-waiting             | =C-c g w=            | открыть фийл Waiting            |
|-----------------------------+----------------------+---------------------------------|




*** Settings Hydra

#+begin_src emacs-lisp

  (use-package hydra
    :bind (("C-c b" . hydra-browser/body)
	   ("C-c t" . hydra-treemacs/body)
	   ("C-c s" . hydra-theme/body)
	   ("C-c o" . hydra-org/body)
	   ("C-c w" . hydra-windows/body)
	   ("C-c T" . hydra-text-scale/body)
	   ("C-c g" . hydra-file-gtd/body)
	   ))

  (use-package major-mode-hydra
    :after hydra
    :preface
    (defun with-alltheicon (icon str &optional height v-adjust face)
      "Display an icon from all-the-icon."
      (s-concat (all-the-icons-alltheicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

    (defun with-faicon (icon str &optional height v-adjust face)
      "Display an icon from Font Awesome icon."
      (s-concat (all-the-icons-faicon icon ':v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

    (defun with-fileicon (icon str &optional height v-adjust face)
      "Display an icon from the Atom File Icons package."
      (s-concat (all-the-icons-fileicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

    (defun with-octicon (icon str &optional height v-adjust face)
      "Display an icon from the GitHub Octicons."
      (s-concat (all-the-icons-octicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str)))

#+end_src

*** Hydra / Browser

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-browser
    (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "chrome" "Browser" 1 -0.05))
    (""
     (("d" engine/search-duckduckgo "Duckduckgo")
      ("i" engine/search-google-images "Google images")
      ("y" engine/search-youtubes "Youtube")
      ("g" engine/search-github "GitHub"))))

#+end_src

*** Hydra / Treemacs

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-treemacs
    (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "file-text" "Treemacs" 1 -0.05))
    (""
     (("t" treemacs "Treemacs")
      ("s" lsp-treemacs-symbols "Treemacs Symbols"))))

#+end_src

*** Hydra / Theme

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-theme
    (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "codepen" "Theme" 1 -0.05))
    ("All Theme"
     (("a" counsel-load-theme "View all themes"))
     "Used themes"
     (("d" set-night-theme "Night theme")
      ("l" set-light-theme "Light theme"))
     "Frame"
     (("p" (et/transparent-frame t) "Transparent frame")
      ("n" (et/transparent-frame nil) "Not transparent frame"))))

#+end_src

*** Hydra / Org

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-org
    (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "codepen" "Org" 1 -0.05))
    (""
     (("g" org-insert-link-global "Insert link")
      ("l" org-store-link "Store link")
      ("c" org-capture "Create capture")
      ("a" org-agenda "Open agenda"))
     "Clock"
     (("j" org-clock-goto "Org clock goto")
      ("d" org-clock-in-last "Org clock in last")
      ("i" org-clock-in "Org clock in")
      ("o" org-clock-out "Org clock uot")
      ("t" org-clock-report "Org clock report"))))

#+end_src

*** Hydra / Windows

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-windows
    (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "windows" "Windows" 1 -0.05))
    (""
     (("g" golden-ratio-mode "Golden ratio")
      ("b" balance-windows   "Balance windows"))
     ""
     (("s" shrink-window               "Shrink window")
      ("[" shrink-window-horizontally  "Shrink window horizontally")
      ("]" enlarge-window-horizontally "Enlarge window horizontally"))))

#+end_src

*** Hydra / Text

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-text-scale
    (:hint nil :forein-keys warn :quit-key "q" :timeout 4 :title (with-faicon "codepen" "Text" 1 -0.05))
    (""
     (("j" text-scale-increase "in")
      ("k" text-scale-decrease "out"))))

#+end_src

*** Hydra / File GTD

#+begin_src emacs-lisp

  (pretty-hydra-define hydra-file-gtd
    (:hint nil :forein-keys warn :quit-key "q" :timeout 4 :title (with-faicon "codepen" "GTD" 1 -0.05))
    ("File GTD"
     (("i" (et/open-inbox) "Open Inbox")
      ("a" (et/open-agenda) "Open Agenda")
      ("j" (et/open-journal) "Open Journal")
      ("n" (et/open-notes) "Open Note"))
     ""
      (("p" (et/open-projects) "Open Project")
      ("s" (et/open-someday) "Open Someday")
      ("t" (et/open-next-tasks) "Open Next task")
      ("w" (et/open-waiting) "Open Waiting"))))

#+end_src
* Development

** Languages

*** IDE Features with lsp-mode

**** lsp-mode

GitHub: [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]]

Я ипользую =lsp-mode=, чтобы сделать IDE-подобную функциональность. Прежде чем настроить =lsp-mode=, ознакомьтесь c [[https://emacs-lsp.github.io/lsp-mode/page/languages/][документацией для своего языка]].

#+begin_src emacs-lisp

  (defun et/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . et/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] - это набор улучшений пользовательского интерфейса, созданных на основе, =lsp-mode= которые делают GNU Emacs еще более похожим на IDE.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

**** lsp-treemacs

GitHub: [[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]]

Treemacs - файловый менеджер древовидной структуры для GNU Emacs.

treemacs-icons-dired - позволяет использовать значки treemacs в dired буферах.

