init.el

(use-package hydra
  :bind (("C-c b" . hydra-browser/body)
	 ("C-c t" . hydra-treemacs/body)
	 ("C-c s" . hydra-theme/body)
	 ("C-c o" . hydra-org/body)
	 ("C-c w" . hydra-windows/body)
	 ("C-c T" . hydra-text-scale/body)
	 ("C-c g" . hydra-file-gtd/body)
	 ))

(use-package major-mode-hydra
  :after hydra
  :preface
  (defun with-alltheicon (icon str &optional height v-adjust face)
    "Display an icon from all-the-icon."
    (s-concat (all-the-icons-alltheicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

  (defun with-faicon (icon str &optional height v-adjust face)
    "Display an icon from Font Awesome icon."
    (s-concat (all-the-icons-faicon icon ':v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

  (defun with-fileicon (icon str &optional height v-adjust face)
    "Display an icon from the Atom File Icons package."
    (s-concat (all-the-icons-fileicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str))

  (defun with-octicon (icon str &optional height v-adjust face)
    "Display an icon from the GitHub Octicons."
    (s-concat (all-the-icons-octicon icon :v-adjust (or v-adjust 0) :height (or height 1) :face face) " " str)))

(pretty-hydra-define hydra-browser
  (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "chrome" "Browser" 1 -0.05))
  (""
   (("d" engine/search-duckduckgo "Duckduckgo")
    ("i" engine/search-google-images "Google images")
    ("y" engine/search-youtubes "Youtube")
    ("g" engine/search-github "GitHub"))))

(pretty-hydra-define hydra-treemacs
  (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "file-text" "Treemacs" 1 -0.05))
  (""
   (("t" treemacs "Treemacs")
    ("s" lsp-treemacs-symbols "Treemacs Symbols"))))

(pretty-hydra-define hydra-theme
  (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "codepen" "Theme" 1 -0.05))
  ("All Theme"
   (("a" counsel-load-theme "View all themes"))
   "Used themes"
   (("d" set-night-theme "Night theme")
    ("l" set-light-theme "Light theme"))
   "Frame"
   (("p" (et/transparent-frame t) "Transparent frame")
    ("n" (et/transparent-frame nil) "Not transparent frame"))))

(pretty-hydra-define hydra-org
  (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "codepen" "Org" 1 -0.05))
  (""
   (("g" org-insert-link-global "Insert link")
    ("l" org-store-link "Store link")
    ("c" org-capture "Create capture")
    ("a" org-agenda "Open agenda"))
   "Clock"
   (("j" org-clock-goto "Org clock goto")
    ("d" org-clock-in-last "Org clock in last")
    ("i" org-clock-in "Org clock in")
    ("o" org-clock-out "Org clock uot")
    ("t" org-clock-report "Org clock report"))))

(pretty-hydra-define hydra-windows
  (:hint nil :forein-keys warn :quit-key "q" :title (with-faicon "windows" "Windows" 1 -0.05))
  (""
   (("g" golden-ratio-mode "Golden ratio")
    ("b" balance-windows   "Balance windows"))
   ""
   (("s" shrink-window               "Shrink window")
    ("[" shrink-window-horizontally  "Shrink window horizontally")
    ("]" enlarge-window-horizontally "Enlarge window horizontally"))))

(pretty-hydra-define hydra-text-scale
  (:hint nil :forein-keys warn :quit-key "q" :timeout 4 :title (with-faicon "codepen" "Text" 1 -0.05))
  (""
   (("j" text-scale-increase "in")
    ("k" text-scale-decrease "out"))))

(pretty-hydra-define hydra-file-gtd
  (:hint nil :forein-keys warn :quit-key "q" :timeout 4 :title (with-faicon "codepen" "GTD" 1 -0.05))
  ("File GTD"
   (("i" (et/open-inbox) "Open Inbox")
    ("a" (et/open-agenda) "Open Agenda")
    ("j" (et/open-journal) "Open Journal")
    ("n" (et/open-notes) "Open Note"))
   ""
    (("p" (et/open-projects) "Open Project")
    ("s" (et/open-someday) "Open Someday")
    ("t" (et/open-next-tasks) "Open Next task")
    ("w" (et/open-waiting) "Open Waiting"))))

(defun et/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . et/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
