myconfig.org
***** Commands

| command                 | key / ex command | description                                                        |
|-------------------------+------------------+--------------------------------------------------------------------|
| lsp-treemacs-symbols    | =C-x t s=        | Показать дерево символов в текущем файле                           |
| lsp-treemacs-references | -                | Показать древовидную структуру для ссылок символа под курсором     |
| lsp-treemacs-error-list | -                | Показать древовидную структуру диагностических сообщений в проекте |
|-------------------------+------------------+--------------------------------------------------------------------|

***** Settings

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

  (global-set-key (kbd "C-x t t") 'treemacs)
  (global-set-key (kbd "C-x t s") 'lsp-treemacs-symbols)

  (use-package treemacs-icons-dired
    :config (treemacs-icons-dired-mode))

#+end_src

**** lsp-ivy

GitHub: [[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]]

Упрощает поиск в коде.

***** Commands

| command                         | key / ex command | description                                                   |
|---------------------------------+------------------+---------------------------------------------------------------|
| lsp-ivy-workspace-symbol        | -                | Поиск имени символа в рабочей области текущего проекта        |
| lsp-ivy-global-workspace-symbol | -                | Поиск имени символа во всех активных рабочих областях проекта |
|---------------------------------+------------------+---------------------------------------------------------------|

***** Settings

#+begin_src emacs-lisp

  (use-package lsp-ivy)

#+end_src

*** Debugging with dap-mode

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] - это пакет для отладки в GNU Emacs.

Документацию по настройки языков можно посмотреть [[https://emacs-lsp.github.io/dap-mode/page/configuration/][тут]].

**** Commands

| command                | key / ex command | description                       |
|------------------------+------------------+-----------------------------------|
| dap-breakpoint-toggle  | -                | поставить точку остановы          |
| dap-breakpoint-delete  | -                | удалить точку остановы            |
| dap-ui-breakpoint-list | -                | спосок всех точек остановы        |
| dap-debug              | -                | запустить отладку                 |
| dap-hydra              | -                | посмотреть как управлять отладкой |
|------------------------+------------------+-----------------------------------|

**** Settings

#+begin_src emacs-lisp

  (use-package dap-mode)

#+end_src

*** TypeScript and JavaScript

#+begin_src emacs-lisp

  ;(use-package typescript-mode
  ;  :mode "\\.ts\\'"
  ;  :hook (typescript-mode . lsp-deferred)
  ;  :config
  ;  (setq typescript-indent-level 2)
  ;  (require 'dap-node)
  ;  (dap-node-setup))

  (use-package js2-mode
    :mode "\\.jsx?\\'"
    :hook (js2-mode . lsp-deferred)
    :config
    (setq js-indent-level 2))

#+end_src

*Важная заметка!* Для =lsp-mode= работы с TypeScript (и JavaScript) вам необходимо установить языковой сервер на вашем компьютере. Если у вас установлен Node.js, самый простой способ сделать это - выполнить следующую команду:

#+begin_src shell :tangle no

  npm i -g typescript-language-server; npm i -g typescript

#+end_src

*** Python

Для Python использую =lsp-mode= и =dap-mode=.

В данной конфигурации используется [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/][pyls]], по этому убедитесь что у вас установлен языковой сервер

#+begin_src sh :tangle no

  pip install --user "python-language-server[all]"
  pip install python-lsp-server

#+end_src

Также вам может понадобиться debugger и среда тестированияя pytest

#+begin_src sh :tangle no

  pip3 install --user debugpy
  pip3 install --user pytest

#+end_src

*Важная заметка!* если при использование OS Windows возникли проблемы, с нормальной работы Python при открытии файлов, попробутей сначало запустить среду Python внутри GNU Emacs при помощи =run-python=.

#+begin_src emacs-lisp

  (use-package python-mode
    :mode "\\.py\\'"
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))

#+end_src

Для =virtualenv= можно использовать =pyvenv=. Чтобы запустить используйте =pyvenv-activate=.

GitHub: [[https://github.com/pythonic-emacs/pyenv-mode][pyvenv]]
GitHub: [[https://github.com/pythonic-emacs/pyenv-mode][pyenv-mode]]

#+begin_src emacs-lisp

  (use-package pyvenv
    :config
    (pyvenv-mode 1))

  (use-package pyenv-mode
    ;; Integrate pyenv with Python-mode
    :hook (python-mode . pyenv-mode)
    :init
    (let ((pyenv-path (expand-file-name "~/.pyenv/bin")))
      (setenv "PATH" (concat pyenv-path ":" (getenv "PATH")))
      (add-to-list 'exec-path pyenv-path))
    :config
    (pyenv-mode))

#+end_src

*** CSharp

GitHub: [[https://github.com/emacs-csharp/csharp-mode][csharp-mode]], [[https://github.com/omajid/csproj-mode][csproj-mode]], [[https://github.com/julienXX/dotnet.el][dotnet]]

=csproj-mode= - Основной режим GNU Emacs для редактирования csproj ( .csproj, .vbproj) и других файлов проекта.
=dotnet= - режим [[https://learn.microsoft.com/en-us/dotnet/core/tools/][dotnet CLI]] для GNU Emacs

Перед использованиям убедитесь что у вас установлен языковой сервер [[https://emacs-lsp.github.io/lsp-mode/page/lsp-csharp-omnisharp/][omnisharp]]. Простой способ это сделать, открыть файл с расширением =.cs= и GNU Emacs сам предложит это сделать или =M-x: lsp-install-server= и выбрать нужный сервер.

#+begin_src emacs-lisp

  (use-package csproj-mode)
  (use-package dotnet)

  (use-package csharp-mode
    :mode "\\.cs\\'"
    :hook ((csharp-mode . lsp-deferred)
	   (csharp-mode . dotnet-mode))
    :config
    (require 'dap-netcore))

#+end_src

Не смотря на то что пакет =dotnet= удобный и позволяет избегать написание одних и тех же команд в терминале, по какой то причине он не развивается и в нем есть недочеты.

Один из них, это не удобная работа с несколькими проектами. При первом запуске =dotnet-run= записывается путь к проекту и при изменения проекта путь остается прежним. Я добавил свою функцию чтобы обнулять =dotnet-run-last-proj-dir=, а после запускать команду =dotnet-run=.

#+begin_src emacs-lisp

  (defun et/dotnet-run ()
    (interactive)
    (setq dotnet-run-last-proj-dir nil)
    (dotnet-run dotnet-run-last-proj-dir))

#+end_src

*** Company Mode

GitHub: [[https://github.com/company-mode/company-mode][company]]

Company - это фреймворк для автозавершения текста для GNU Emacs.

GitHub: [[https://github.com/sebastiencs/company-box][company-box]]

Фирменный интерфейс с иконками.

#+begin_src emacs-lisp

  (use-package company
    ;:after lsp-mode
    ;:hook (lsp-mode . company-mode)
    :hook (after-init . global-company-mode)
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

*** Web mode

GitHub: [[https://github.com/fxbois/web-mode][web-mode]]

web-mode - это режим emacs для редактирования веб-шаблонов.

#+begin_src emacs-lisp

  (use-package web-mode
    :mode (("\\.css$"  . web-mode)
           ("\\.html$" . web-mode)))

#+end_src

*** JSON

=json-mode= - режим GNU Emacs для обработки файлов JSON

GitHub: [[https://github.com/joshwnj/json-mode][json-mode]]

#+begin_src emacs-lisp

  (use-package json-mode
    :mode "\\.json\\'")

#+end_src

*** YAML

=yaml-mode= - режим GNU Emacs для обработки файлов YAML/YML

GitHub: [[https://github.com/yoshiki/yaml-mode][yaml-mode]]

#+begin_src emacs-lisp

  (use-package yaml-mode
    :mode (("\\.yml$"  . yaml-mode)
           ("\\.yaml$" . yaml-mode)))

#+end_src

*** Makefile

=makefile-gmake-mode= - режим GNU Emacs для обработки файлов Makefile

#+begin_src emacs-lisp

  (use-package makefile-gmake-mode
    :ensure nil
    :mode  ("Makefile.*" . makefile-gmake-mode))

#+end_src

** Buildsystem

*** Docker

=Docker=, режим для управления докером из GNU Emacs.

GitHub: [[https://github.com/Silex/docker.el][docker]]

#+begin_src emacs-lisp

  (use-package docker
    :bind ("C-c d" . docker))

#+end_src

=Dockerfile Mode= — режим GNU Emacs для обработки файлов Dockerfile.

GitHub: [[https://github.com/spotify/dockerfile-mode][dockerfile-mode]]

#+begin_src emacs-lisp

  (use-package dockerfile-mode)

#+end_src

** Projectile

GitHub: [[https://github.com/bbatsov/projectile/tree/db5748ea4a6428136769e7e50c6d0a12aa7acd8f][projectile]]

Projectile - это библиотека взаимодействия с проектом для GNU Emacs.

*** Commands

| command                              | key / ex command | description                                                     |
|--------------------------------------+------------------+-----------------------------------------------------------------|
| projectile-command-map               | =C-x p=          |                                                                 |
| projectile-find-file                 | =C-x p f=        | Показать список всех файлов в проекте.                          |
|                                      |                  | С аргументом префикса он сначала очистит кеш.                   |
| projectile-find-file-other-window    | =C-x p 4 f=      | Перейти к файлу проекта с помощью                               |
|                                      |                  | завершения и показать его в другом окне.                        |
| projectile-find-dir                  | =C-x p d=        | Показать список всех каталогов в проекте.                       |
|                                      |                  | С аргументом префикса он сначала очистит кеш.                   |
| projectile-find-dir-other-window     | =C-x p 4 d=      | Перейдите в каталог проекта и покажите его в другом окне.       |
| projectile-switch-to-buffer          | =C-x p b=        | Показать список всех буферов проекта, открытых в данный момент. |
| projectile-dired                     | =C-x p D=        | Открывает корень проекта в формате dired                        |
| projectile-kill-buffers              | =C-x p k=        | Убивает все буферы проекта.                                     |
| projectile-recentf                   | =C-x p e=        | Показывает список недавно посещенных файлов проекта.            |
| projectile-next-project-buffer       | =C-x p left=     | Переключиться на предыдущий буфер проекта.                      |
| projectile-previous-project-buffer   | =C-x p right=    | Переключиться на следующий буфер проекта.                       |
| projectile-run-shell-command-in-root | =C-x p !=        | Запускается shell-command в корневом каталоге проекта.          |
| projectile-run-shell                 | =C-x p x s=      | Запускается shell.                                              |
| projectile-save-project-buffer       | =C-x p S=        | Сохраните все буферы проекта.                                   |
| projectile-switch-project            | =C-x p p=        | Отображение списка известных проектов                           |
|--------------------------------------+------------------+-----------------------------------------------------------------|

Полный список команд можно посмотреть по [[https://docs.projectile.mx/projectile/usage.html][ссылке]].

*** Settings

#+begin_src emacs-lisp

  (use-package projectile
    :config
      (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)
      (projectile-mode +1))

#+end_src

** Magit

GitHub: [[https://github.com/magit/magit][magit]]

Magit - это интерфейс системы контроля версий Git.

*** Commands

| command              | key / ex command | description                                                                      |
|----------------------+------------------+----------------------------------------------------------------------------------|
| magit-status         | =C-x g=          | состояние репозитория (git status)                                               |
| magit-stage-file     | =s=              | добавить изменения в точке в промежуточную область (git add <file>)              |
| magit-stage-modified | =S=              | внести все изменения в файлах, измененные в рабочем дереве (git add .)           |
| magit-unstage-file   | =u=              | удалить изменения в точке из промежуточной области (git restore --staged <file>) |
| magit-unstage-all    | =U=              | удалить все изменения из промежуточной области (git restore --staged .)          |
| magit-commit         | =c=              | коммит (git commit)                                                              |
|                      | =?=              | открыть все команды magit                                                        |
|----------------------+------------------+----------------------------------------------------------------------------------|

