init.el

(use-package lsp-treemacs
  :after lsp)

(global-set-key (kbd "C-x t t") 'treemacs)
(global-set-key (kbd "C-x t s") 'lsp-treemacs-symbols)

(use-package treemacs-icons-dired
  :config (treemacs-icons-dired-mode))

(use-package lsp-ivy)

(use-package dap-mode)

;(use-package typescript-mode
;  :mode "\\.ts\\'"
;  :hook (typescript-mode . lsp-deferred)
;  :config
;  (setq typescript-indent-level 2)
;  (require 'dap-node)
;  (dap-node-setup))

(use-package js2-mode
  :mode "\\.jsx?\\'"
  :hook (js2-mode . lsp-deferred)
  :config
  (setq js-indent-level 2))

(use-package python-mode
  :mode "\\.py\\'"
  :hook (python-mode . lsp-deferred)
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  ;; (python-shell-interpreter "python3")
  ;; (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))

(use-package pyvenv
  :config
  (pyvenv-mode 1))

(use-package pyenv-mode
  ;; Integrate pyenv with Python-mode
  :hook (python-mode . pyenv-mode)
  :init
  (let ((pyenv-path (expand-file-name "~/.pyenv/bin")))
    (setenv "PATH" (concat pyenv-path ":" (getenv "PATH")))
    (add-to-list 'exec-path pyenv-path))
  :config
  (pyenv-mode))

(use-package csproj-mode)
(use-package dotnet)

(use-package csharp-mode
  :mode "\\.cs\\'"
  :hook ((csharp-mode . lsp-deferred)
	 (csharp-mode . dotnet-mode))
  :config
  (require 'dap-netcore))

(defun et/dotnet-run ()
  (interactive)
  (setq dotnet-run-last-proj-dir nil)
  (dotnet-run dotnet-run-last-proj-dir))

(use-package company
  ;:after lsp-mode
  ;:hook (lsp-mode . company-mode)
  :hook (after-init . global-company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package web-mode
  :mode (("\\.css$"  . web-mode)
         ("\\.html$" . web-mode)))

(use-package json-mode
  :mode "\\.json\\'")

(use-package yaml-mode
  :mode (("\\.yml$"  . yaml-mode)
         ("\\.yaml$" . yaml-mode)))

(use-package makefile-gmake-mode
  :ensure nil
  :mode  ("Makefile.*" . makefile-gmake-mode))

(use-package docker
  :bind ("C-c d" . docker))

(use-package dockerfile-mode)

(use-package projectile
  :config
    (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)
    (projectile-mode +1))
