myconfig.org
*** Settings

#+begin_src emacs-lisp

  (use-package magit
    :bind (("C-x g" . #'magit-status)))

#+end_src

** Rainbow Delimiters

GitHub: [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]

Полезно в режимах программирования, потому что раскрашивают вложенные круглые скобки в соответствии с их глубиной вложенности.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Terminals

** Eshell

=Eshell= — это собственная реализация оболочки GNU Emacs, написанная на GNU Emacs Lisp.

=eshell-git-prompt= - пакет предоставляет темы приглашения GNU Emacs Shell (Eshell).

GitHub: [[https://github.com/xuchunyang/eshell-git-prompt][eshell-git-prompt]]

#+begin_src emacs-lisp

  (defun et/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . et/configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim")))

    (eshell-git-prompt-use-theme 'multiline2))

#+end_src
